---
title: ModelCurveArray
classe: Autodesk.Revit.DB.ModelCurveArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ModelCurveArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `modelCurveArray.IsEmpty` | Boolean |
| `ModelCurve Item { get; set; }` | `modelCurveArray.Item` | ModelCurve |
| `Int32 Size { get; }` | `modelCurveArray.Size` | Int32 |
| `Void Append(ModelCurve)` | `modelCurveArray.Append(item)` | Void |
| `Void Clear()` | `modelCurveArray.Clear()` | Void |
| `ModelCurveArrayIterator ForwardIterator()` | `modelCurveArray.ForwardIterator()` | ModelCurveArrayIterator |
| `IEnumerator GetEnumerator()` | `modelCurveArray.GetEnumerator()` | IEnumerator |
| `Void Insert(ModelCurve, Int32)` | `modelCurveArray.Insert(item, index)` | Void |
| `ModelCurveArrayIterator ReverseIterator()` | `modelCurveArray.ReverseIterator()` | ModelCurveArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```